Tekla Open API Reference for Tekla Structures 2025
RebarItem.DIAGONAL_RATIO_STRING Field
 The diagonal ratio string.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string DIAGONAL_RATIO_STRING = "DiagonalRatio"
Public Const DIAGONAL_RATIO_STRING As String = "DiagonalRatio"
Field Value
Type: String
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace